docs/evidence/dev-backend-performance-2026-07-26/raw/controlled-write-run-1-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /work/backend/load_tests/dev_backend_baseline.js
        output: json (/work/backend/load_tests/results/controlled-write-run-1-points.json)

     scenarios: (100.00%) 1 scenario, 2 max VUs, 1m30s max duration (incl. graceful stop):
              * controlled-write: 0.20 iterations/s for 1m0s (maxVUs: 1-2, gracefulStop: 30s)


Run                [ 100% ] setup()
controlled-write   [   0% ]

running (0m02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
controlled-write   [   1% ] 1/1 VUs  0m00.8s/1m0s  0.20 iters/s

running (0m03.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
controlled-write   [   3% ] 1/1 VUs  0m01.8s/1m0s  0.20 iters/s

running (0m04.0s), 0/1 VUs, 1 complete and 0 interrupted iterations
controlled-write   [   5% ] 0/1 VUs  0m02.8s/1m0s  0.20 iters/s

running (0m05.0s), 0/1 VUs, 1 complete and 0 interrupted iterations
controlled-write   [   6% ] 0/1 VUs  0m03.8s/1m0s  0.20 iters/s

running (0m06.0s), 0/1 VUs, 1 complete and 0 interrupted iterations
controlled-write   [   8% ] 0/1 VUs  0m04.8s/1m0s  0.20 iters/s

running (0m07.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
controlled-write   [  10% ] 1/1 VUs  0m05.8s/1m0s  0.20 iters/s

running (0m08.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
controlled-write   [  11% ] 1/1 VUs  0m06.8s/1m0s  0.20 iters/s

running (0m09.0s), 0/1 VUs, 2 complete and 0 interrupted iterations
controlled-write   [  13% ] 0/1 VUs  0m07.8s/1m0s  0.20 iters/s

running (0m10.0s), 0/1 VUs, 2 complete and 0 interrupted iterations
controlled-write   [  15% ] 0/1 VUs  0m08.8s/1m0s  0.20 iters/s

running (0m11.0s), 0/1 VUs, 2 complete and 0 interrupted iterations
controlled-write   [  16% ] 0/1 VUs  0m09.8s/1m0s  0.20 iters/s

running (0m12.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
controlled-write   [  18% ] 1/1 VUs  0m10.8s/1m0s  0.20 iters/s

running (0m13.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
controlled-write   [  20% ] 1/1 VUs  0m11.8s/1m0s  0.20 iters/s

running (0m14.0s), 0/1 VUs, 3 complete and 0 interrupted iterations
controlled-write   [  21% ] 0/1 VUs  0m12.8s/1m0s  0.20 iters/s

running (0m15.0s), 0/1 VUs, 3 complete and 0 interrupted iterations
controlled-write   [  23% ] 0/1 VUs  0m13.8s/1m0s  0.20 iters/s

running (0m16.0s), 0/1 VUs, 3 complete and 0 interrupted iterations
controlled-write   [  25% ] 0/1 VUs  0m14.8s/1m0s  0.20 iters/s

running (0m17.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
controlled-write   [  26% ] 1/1 VUs  0m15.8s/1m0s  0.20 iters/s

running (0m18.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
controlled-write   [  28% ] 1/1 VUs  0m16.8s/1m0s  0.20 iters/s

running (0m19.0s), 0/1 VUs, 4 complete and 0 interrupted iterations
controlled-write   [  30% ] 0/1 VUs  0m17.8s/1m0s  0.20 iters/s

running (0m20.0s), 0/1 VUs, 4 complete and 0 interrupted iterations
controlled-write   [  31% ] 0/1 VUs  0m18.8s/1m0s  0.20 iters/s

running (0m21.0s), 0/1 VUs, 4 complete and 0 interrupted iterations
controlled-write   [  33% ] 0/1 VUs  0m19.8s/1m0s  0.20 iters/s

running (0m22.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
controlled-write   [  35% ] 1/1 VUs  0m20.8s/1m0s  0.20 iters/s

running (0m23.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
controlled-write   [  36% ] 1/1 VUs  0m21.8s/1m0s  0.20 iters/s

running (0m24.0s), 0/1 VUs, 5 complete and 0 interrupted iterations
controlled-write   [  38% ] 0/1 VUs  0m22.8s/1m0s  0.20 iters/s

running (0m25.0s), 0/1 VUs, 5 complete and 0 interrupted iterations
controlled-write   [  40% ] 0/1 VUs  0m23.8s/1m0s  0.20 iters/s

running (0m26.0s), 0/1 VUs, 5 complete and 0 interrupted iterations
controlled-write   [  41% ] 0/1 VUs  0m24.8s/1m0s  0.20 iters/s

running (0m27.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
controlled-write   [  43% ] 1/1 VUs  0m25.8s/1m0s  0.20 iters/s

running (0m28.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
controlled-write   [  45% ] 1/1 VUs  0m26.8s/1m0s  0.20 iters/s

running (0m29.0s), 0/1 VUs, 6 complete and 0 interrupted iterations
controlled-write   [  46% ] 0/1 VUs  0m27.8s/1m0s  0.20 iters/s

running (0m30.0s), 0/1 VUs, 6 complete and 0 interrupted iterations
controlled-write   [  48% ] 0/1 VUs  0m28.8s/1m0s  0.20 iters/s

running (0m31.0s), 0/1 VUs, 6 complete and 0 interrupted iterations
controlled-write   [  50% ] 0/1 VUs  0m29.8s/1m0s  0.20 iters/s

running (0m32.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
controlled-write   [  51% ] 1/1 VUs  0m30.8s/1m0s  0.20 iters/s

running (0m33.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
controlled-write   [  53% ] 1/1 VUs  0m31.8s/1m0s  0.20 iters/s

running (0m34.0s), 0/1 VUs, 7 complete and 0 interrupted iterations
controlled-write   [  55% ] 0/1 VUs  0m32.8s/1m0s  0.20 iters/s

running (0m35.0s), 0/1 VUs, 7 complete and 0 interrupted iterations
controlled-write   [  56% ] 0/1 VUs  0m33.8s/1m0s  0.20 iters/s

running (0m36.0s), 0/1 VUs, 7 complete and 0 interrupted iterations
controlled-write   [  58% ] 0/1 VUs  0m34.8s/1m0s  0.20 iters/s

running (0m37.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
controlled-write   [  60% ] 1/1 VUs  0m35.8s/1m0s  0.20 iters/s

running (0m38.0s), 0/1 VUs, 8 complete and 0 interrupted iterations
controlled-write   [  61% ] 0/1 VUs  0m36.8s/1m0s  0.20 iters/s

running (0m39.0s), 0/1 VUs, 8 complete and 0 interrupted iterations
controlled-write   [  63% ] 0/1 VUs  0m37.8s/1m0s  0.20 iters/s

running (0m40.0s), 0/1 VUs, 8 complete and 0 interrupted iterations
controlled-write   [  65% ] 0/1 VUs  0m38.8s/1m0s  0.20 iters/s

running (0m41.0s), 0/1 VUs, 8 complete and 0 interrupted iterations
controlled-write   [  66% ] 0/1 VUs  0m39.8s/1m0s  0.20 iters/s

running (0m42.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
controlled-write   [  68% ] 1/1 VUs  0m40.8s/1m0s  0.20 iters/s

running (0m43.0s), 0/1 VUs, 9 complete and 0 interrupted iterations
controlled-write   [  70% ] 0/1 VUs  0m41.8s/1m0s  0.20 iters/s

running (0m44.0s), 0/1 VUs, 9 complete and 0 interrupted iterations
controlled-write   [  71% ] 0/1 VUs  0m42.8s/1m0s  0.20 iters/s

running (0m45.0s), 0/1 VUs, 9 complete and 0 interrupted iterations
controlled-write   [  73% ] 0/1 VUs  0m43.8s/1m0s  0.20 iters/s

running (0m46.0s), 0/1 VUs, 9 complete and 0 interrupted iterations
controlled-write   [  75% ] 0/1 VUs  0m44.8s/1m0s  0.20 iters/s

running (0m47.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
controlled-write   [  76% ] 1/1 VUs  0m45.8s/1m0s  0.20 iters/s

running (0m48.0s), 0/1 VUs, 10 complete and 0 interrupted iterations
controlled-write   [  78% ] 0/1 VUs  0m46.8s/1m0s  0.20 iters/s

running (0m49.0s), 0/1 VUs, 10 complete and 0 interrupted iterations
controlled-write   [  80% ] 0/1 VUs  0m47.8s/1m0s  0.20 iters/s

running (0m50.0s), 0/1 VUs, 10 complete and 0 interrupted iterations
controlled-write   [  81% ] 0/1 VUs  0m48.8s/1m0s  0.20 iters/s

running (0m51.0s), 0/1 VUs, 10 complete and 0 interrupted iterations
controlled-write   [  83% ] 0/1 VUs  0m49.8s/1m0s  0.20 iters/s

running (0m52.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
controlled-write   [  85% ] 1/1 VUs  0m50.8s/1m0s  0.20 iters/s

running (0m53.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
controlled-write   [  86% ] 1/1 VUs  0m51.8s/1m0s  0.20 iters/s

running (0m54.0s), 0/1 VUs, 11 complete and 0 interrupted iterations
controlled-write   [  88% ] 0/1 VUs  0m52.8s/1m0s  0.20 iters/s

running (0m55.0s), 0/1 VUs, 11 complete and 0 interrupted iterations
controlled-write   [  90% ] 0/1 VUs  0m53.8s/1m0s  0.20 iters/s

running (0m56.0s), 0/1 VUs, 11 complete and 0 interrupted iterations
controlled-write   [  91% ] 0/1 VUs  0m54.8s/1m0s  0.20 iters/s

running (0m57.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
controlled-write   [  93% ] 1/1 VUs  0m55.8s/1m0s  0.20 iters/s

running (0m58.0s), 0/1 VUs, 12 complete and 0 interrupted iterations
controlled-write   [  95% ] 0/1 VUs  0m56.8s/1m0s  0.20 iters/s

running (0m59.0s), 0/1 VUs, 12 complete and 0 interrupted iterations
controlled-write   [  96% ] 0/1 VUs  0m57.8s/1m0s  0.20 iters/s

running (1m00.0s), 0/1 VUs, 12 complete and 0 interrupted iterations
controlled-write   [  98% ] 0/1 VUs  0m58.8s/1m0s  0.20 iters/s

running (1m01.0s), 0/1 VUs, 12 complete and 0 interrupted iterations
controlled-write   [ 100% ] 0/1 VUs  0m59.8s/1m0s  0.20 iters/s

running (1m02.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
controlled-write ↓ [ 100% ] 1/1 VUs  1m0s  0.20 iters/s

running (1m03.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
controlled-write ↓ [ 100% ] 1/1 VUs  1m0s  0.20 iters/s


  █ THRESHOLDS 

    timeout_count
    ✓ 'count==0' count=0

    unexpected_5xx_count
    ✓ 'count==0' count=0

    unexpected_error_rate
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 54      0.844532/s
    checks_succeeded...: 100.00% 54 out of 54
    checks_failed......: 0.00%   0 out of 54


    CUSTOM
    http_status_count..............: 27    0.422266/s
    latency_login..................: avg=1.15s    min=1.15s    p(50)=1.15s    p(95)=1.15s   p(99)=1.15s   max=1.15s  
    latency_push_token_delete......: avg=729.44ms min=689.07ms p(50)=716.14ms p(95)=795.7ms p(99)=826.5ms max=834.2ms
    latency_push_token_save........: avg=1.11s    min=1.03s    p(50)=1.07s    p(95)=1.29s   p(99)=1.44s   max=1.47s  
    timeout_count..................: 0     0/s
    unexpected_5xx_count...........: 0     0/s
    unexpected_error_rate..........: 0.00% 0 out of 27

    HTTP
    http_req_duration..............: avg=921.68ms min=680.06ms p(50)=933.61ms p(95)=1.16s   p(99)=1.39s   max=1.47s  
      { expected_response:true }...: avg=921.68ms min=680.06ms p(50)=933.61ms p(95)=1.16s   p(99)=1.39s   max=1.47s  
    http_req_failed................: 0.00% 0 out of 28
    http_reqs......................: 28    0.437906/s

    EXECUTION
    iteration_duration.............: avg=1.84s    min=1.72s    p(50)=1.79s    p(95)=2.08s   p(99)=2.19s   max=2.22s  
    iterations.....................: 13    0.203313/s
    vus............................: 1     min=0       max=1
    vus_max........................: 1     min=1       max=1

    NETWORK
    data_received..................: 22 kB 341 B/s
    data_sent......................: 11 kB 166 B/s



running (1m03.9s), 0/1 VUs, 13 complete and 0 interrupted iterations
controlled-write ✓ [ 100% ] 0/1 VUs  1m0s  0.20 iters/s